// maybe good hosting for future:
// npoint.io

import { assignBasicIdsToQuestionsAndAnswers } from '@/utils/main';

const vars = {
  otherOrNothingOrNotWant:
    'სხვა პასუხი მაქვს, ან არ მსურს პასუხის გაცემა, ან არ მაქვს პასუხი.',
} as const;

const form001: nsFormMin.One = {
  id: `form001`,
  title: 'Soul Style fsdg dfgdfgdfgdf g',
  info: '',
  details: 'sdfsfd',
  versionId: '1',

  questions: [
    {
      question: 'ასაკი',
      selectableAnswers: [
        { t: '18-19' },
        { t: '20-22' },
        { t: '23-26' },
        { t: '27-29' },
        { t: '30-32' },
        { t: '33-36' },
        { t: '37-39' },
        { t: '40-42' },
        { t: '43-46' },
        { t: '47-49' },
        { t: '50+' },
        { t: vars.otherOrNothingOrNotWant },
      ],
    },
    //
    {
      question: 'sdfsd',
      selectableAnswers: [
        { t: 'sdfsdfsdfsdfsdfdsfdsfsdfssdfsdfsdfsdfsdfdfsdsd' },
        // vars.otherOrNothingOrNotWant,
      ],
    },
    //
    {
      question: 'შვილი ან შვილები',
      selectableAnswers: [
        { t: 'არ მყავს და მინდა ოდესმე მყავდეს' },
        { t: 'არ მინდა მყავდეს' },
        { t: 'მყავს და მეტი აღარ მინდა' },
        { t: 'მყავს და ალბათ მეტი მეყოლება ოდესმე' },
        { t: vars.otherOrNothingOrNotWant },
      ],
    },
    //
    {
      question: 'სიგარეტის მოწევა',
      selectableAnswers: [
        { t: 'არ ვეწევი და არც მინდა ოდესმე გავეკარო' },
        { t: 'არ ვეწევი მაგრამ შესაძლოა დავიწყო მოწევა ოდესმე' },
        { t: 'ვეწევი' },
        { t: vars.otherOrNothingOrNotWant },
      ],
    },
    //
    {
      question:
        'ვცდილობ ფორმაში ვიყო ფიზიკურად, თუნდაც მსუბუქი ვარჯიშით ან სხვა სახის აქტივობით',
      selectableAnswers: [
        {
          t: 'კი, ჩემთვის მ',
        },
      ],
    },
    //
    {
      question: 'ტატუ',
      selectableAnswers: [
        {
          t: `არ მაქვს და არც მსურს რომ ოდესმე მქონდეს სხეულზე`,
        },
        {
          t: `მაქვს მაგრამ ახლა ვაცნობიერებ რომ არ მსურს ტატუ მქონდეს სხეულზე`,
        },
        {
          t: `მაქვს და მომწონს`,
        },

        { t: vars.otherOrNothingOrNotWant },
      ],
    },
    //
    {
      question: 'პირსინგი (საყურის გარდა)',
      selectableAnswers: [
        {
          t: `არ მაქვს და არც მსურს რომ ოდესმე მქონდეს`,
        },
        {
          t: `მაქვს მაგრამ ახლა ვაცნობიერებ რომ არ მსურს მქონდეს`,
        },
        {
          t: `მაქვს და მომწონს`,
        },

        { t: vars.otherOrNothingOrNotWant },
      ],
    },
    //
    {
      question: 'საყურე',
      selectableAnswers: [
        ////// what is he he he?
        {
          t: `არ მაქვს და არც მსურს რომ ოდესმე მქონდეს`,
        },
        {
          t: `მაქვს, ცალ ყურზე ჩემი მაქსიმუმია ერთი ცალი საყურე`,
        },
        {
          t: `მაქვს, ცალ ყურზე ჩემი მაქსიმუმია ერთზე მეტი საყურე`,
        },

        { t: vars.otherOrNothingOrNotWant },
      ],
    },
    //
    {
      question: 'ფრჩხილების დაგრძელება',
      selectableAnswers: [
        {
          t: `არ მაქვს და არც მსურს რომ ოდესმე მქონდეს`,
        },
        {
          t: `მაქვს, ცალ ყურზე ჩემი მაქსიმუმია ერთი ცალი საყურე`,
        },
        {
          t: `მაქვს, ცალ ყურზე ჩემი მაქსიმუმია ერთზე მეტი საყურე`,
        },

        { t: vars.otherOrNothingOrNotWant },
      ],
    },
    //
    {
      question: 'ლგბტ',
      selectableAnswers: [
        {
          t: `ისინი ისეთივე კარგი/თანასწორი ადამიანები არიან როგორც სხვა დანარჩენი. ბიოლოგიურ/ფსიქოლოგიურ მდგომარეობას რაც შეეხება, ვფიქრობ რომ არაა ჯანსაღი მდგომარეობა.`,
        },
        {
          t: `ისინი ისეთივე კარგი/თანასწორი ადამიანები არიან როგორც სხვა დანარჩენი. ბიოლოგიურ/ფსიქოლოგიურ მდგომარეობას რაც შეეხება, ვფიქრობ რომ სრულიად ჯანსაღი მდგომარეობაა.`,
        },
        {
          t: `ისინი ისეთივე კარგი/თანასწორი ადამიანები არიან როგორც სხვა დანარჩენი. ბიოლოგიურ/ფსიქოლოგიურ მდგომარეობას რაც შეეხება, არ მაქ ჩემი აზრი ამაზე.`,
        },

        { t: vars.otherOrNothingOrNotWant },
      ],
    },
    //
    {
      question: 'ასტროლოგია',
      selectableAnswers: [
        {
          t: 'ვფიქრობ რომ მცდარია ადამიანების აღწერა (დაბადების თარიღის მიხედვით) და რეკომენდაციები (როდის როგორ ჯობია რომ მოვიქცეთ)',
        },
        {
          t: 'ვფიქრობ რომ სწორია ყველანაირად',
        },
        {
          t: 'ვფიქრობ რომ ნაწილობრივ სწორია ადამიანების აღწერა (დაბადების თარიღის მიხედვით) და რეკომენდაციები (როდის როგორ ჯობია რომ მოვიქცეთ)',
        },
        { t: vars.otherOrNothingOrNotWant },
      ],
    },
    //
    {
      question: 'რელიგია',
      selectableAnswers: [
        { t: `ქრისტიანი ვარ` },
        { t: `სხვა რელიგია` },
        { t: `არ ვარ არცერთი რელიგიის მიმდევარი` },
        { t: vars.otherOrNothingOrNotWant },
      ],
    },
    //
    {
      question: 'ჩემი დამოკიდებულება ჩემი რელიგიისადმი',
      selectableAnswers: [
        {
          t: `მაქვს ძლიერი სურვილი რომ მუდმივად უფრო და უფრო სიღრმისეულად ჩავწვდე და სულიერად განვვითარდე`,
        },
        {
          t: `მაქვს ასე თუ ისე სურვილი რომ მუდმივად უფრო და უფრო სიღრმისეულად ჩავწვდე და სულიერად განვვითარდე`,
        },
        {
          t: `მაინცდამაინც არ მაქვს სურვილი რომ მუდმივად უფრო და უფრო სიღრმისეულად ჩავწვდე და სულიერად განვვითარდე`,
        },
        { t: `არ ვარ არცერთი რელიგიის მიმდევარი` },

        { t: vars.otherOrNothingOrNotWant },
      ],
    },
    //
    {
      question: 'ლოცვა',
      selectableAnswers: [
        {
          t: `მჯერა რომ ძლიერი დამხმარეა სულიერი სიჯანსაღისთვის`,
        },
        {
          t: `ასე თუ ისე მჯერა რომ კარგი რამეა`,
        },
        {
          t: `არ მჯერა რომ ლოცვას რაიმე სულიერი ძალა აქვს და/ან არ მჯერა სულიერი სამყაროს არსებობის`,
        },

        { t: vars.otherOrNothingOrNotWant },
      ],
    },
  ],
};

export const form001_withIds = assignBasicIdsToQuestionsAndAnswers(form001);
